# language: ru

Функция: Определения

	Сценарий: СИНТАН.ОПР.РАЗДЕЛ ссылка
	Пусть открыт файл "тест-определения.фядот".
	Когда получен список определений для слова "термин" в следующем тексте:
	"""
	Но отсюда можно ссылаться на *термин 1*.
	"""
	Тогда этот список должен включать определение в файле "тест-определения.фядот" с текстом:
	"""
	Определение первого термина в разделе определений.
	"""

	Сценарий: СИНТАН.ОПР.РАЗДЕЛ со вторым разделом в файле
	# Термин определен во втором разделе с определениями
	Пусть открыт файл "тест-определения.фядот".
	Когда получен список определений для слова "термин" в следующем тексте:
	"""
	Отсюда можно ссылаться на *термин 3*, который определен ниже.
	"""
	Тогда этот список должен включать определение в файле "тест-определения.фядот" с текстом:
	"""
	Определение третьего термина во втором разделе определений.
	"""

	Сценарий: СИНТАН.ОПР.КНТ.ПРМ
	Пусть открыт файл "тест-определения.фядот".
	Когда получен список определений для слова "ПКО" в следующем тексте:
	"""
	Вот ссылка на *ПКО*.
	"""
	Тогда этот список должен включать определение в файле "тест-определения.фядот" с текстом:
	"""
	Прямое Контекстное Определение
	"""

	Сценарий: СИНТАН.ОПР.КНТ.ОБР
	Пусть открыт файл "тест-определения.фядот".
	Когда получен список определений для слова "ОКО" в следующем тексте:
	"""
	Вот ссылка на *ОКО*.
	"""
	Тогда этот список должен включать определение в файле "тест-определения.фядот" с текстом:
	"""
	Обратное Контекстное Определение
	"""

	Сценарий: СИНТАН.ОПР.КНТ.ПОЛН
	Пусть открыт файл "тест-определения.фядот".
	Когда получен список определений для слова "РКО" в следующем тексте:
	"""
	Вот ссылка на *РКО*.
	"""
	Тогда этот список должен включать определение в файле "тест-определения.фядот" с текстом:
	"""
	Развернутое контекстное определение *РКО* *(n.b.)* состоит из всего предложения.
	"""

	@ru_only
	Сценарий: СТРУКТАН.ОШИБКА.ОПРЕДЕЛЕНИЯ.ДУБЛИКАТ
	Пусть открыт файл "тест-определения.фядот".
	Тогда в список проблем редактора входит ошибка для слов "Термин 2" с текстом:
	"""
	Термин 'Термин 2' имеет несколько определений
	"""

