# language: ru

Функция: Синтаксический Анализатор

	Сценарий: СИНТАН.РЕАЛЕЗАЦИЯ.ГРП -- связь
	# проверка связи с групповым утверждением о реализации
	Пусть открыт файл "тесты.фядот".
	Если получен список определений для слова "неформальных" в следующем тексте:
	"""
	* Реализует **Раздел неформальных требований**
	"""
	Тогда этот список должен включать определение в файле "тест-неформал.фядот" с текстом:
	"""
	Этот раздел представляет пример неформального требования, которое может быть реализовано формальными требованиями в других файлах.
	"""

	Сценарий: СИНТАН.РЕАЛЕЗАЦИЯ.ИНД -- связь
	# проверка связи с индивидуальным утверждением о реализации
	Пусть открыт файл "тесты.фядот".
	Если получен список определений для слова "неформальное" в следующем тексте:
	"""
	* Реализует **Подраздел как неформальное требование**
	"""
	Тогда этот список должен включать определение в файле "тест-неформал.фядот" с текстом:
	"""
	Этот подраздел также представляет пример неформального требования.
	"""

	@ru_only
	Сценарий: СИНТАН.ОШИБКА.НЕТ_ОБОСН с существующим файлом
	# В существующем файле требование без реализации генерирует ошибки "Нет реализации"
	Пусть открыт файл "тесты.фядот" содержащий требование с идентификатором "Тест.РЕДАКТОР.НЕТ_РЕАЛ".
	Тогда в список проблем редактора входит ошибка с текстом:
	"""
	Требование Тест.РЕДАКТОР.НЕТ_РЕАЛ не имеет никакого обоснования
	"""

	@ru_only
	Сценарий: СИНТАН.ПРЕДУПР.БЕЗ_РЕАЛ с существующим файлом
	# В существующем файле требования без реализации, но с обоснованием, генерирует предупреждение
	Пусть открыт файл "тесты.фядот" содержащий требование с идентификатором "Тест.Синтан.ПРД_ОБОСН".
	Тогда в список проблем редактора входит предупреждение с текстом:
	"""
	Требование Тест.Синтан.ПРД_ОБОСН оправдано только его обоснованием и ни одним из требований более высокого уровня
	"""

	@ru_only
	Шаблон сценария: СИНТАН.ОШИБКА.СЛОВА для TBD
	Пусть открыт файл "тесты.фядот" содержащий требование с идентификатором "Тест.Синтан.TBD".
	Тогда в список проблем редактора входит ошибка с текстом:
	"""
	Требование Тест.Синтан.TBD содержит TBD
	"""

	@ru_only
	Шаблон сценария: СИНТАН.ОШИБКА.СЛОВА для TODO
	Пусть открыт файл "тесты.фядот" содержащий требование с идентификатором "Тест.Синтан.TODO".
	Тогда в список проблем редактора входит ошибка с текстом:
	"""
	Требование Тест.Синтан.TODO содержит TODO
	"""

	@ru_only
	Шаблон сценария: СИНТАН.ОШИБКА.СЛОВА для FIXME
	Пусть открыт файл "тесты.фядот" содержащий требование с идентификатором "Тест.Синтан.FIXME".
	Тогда в список проблем редактора входит ошибка с текстом:
	"""
	Требование Тест.Синтан.FIXME содержит FIXME
	"""
