# language: ru

Функция: Структурный Анализатор

	Сценарий: СТРУКТАН.РЕАЛ для файла с требованиями
	Пусть открыт файл "тесты.фядот".
	Если получен список ссылок для слова "Структан" в следующем тексте:
	"""
	Тест.Структан.РЕАЛ_В_КМНТ
	"""
	Тогда этот список должен включать ссылку из файла "нижн-уровень.фядот" с идентификатором "Нижний.уровень".

	Сценарий: СТРУКТАН.РЕАЛ для файла с реализацией
	Пусть открыт файл "тесты.фядот".
	Если получен список ссылок для слова "Структан" в следующем тексте:
	"""
	Тест.Структан.РЕАЛ_В_КМНТ
	"""
	Тогда этот список должен включать ссылку из файла "файл-с-реализацией.txt" с идентификатором "Тест.Структан.РЕАЛ_В_КМНТ", следующим за текстом "$$Реализует".

	@ru_only
	Сценарий: СТРУКТАН.ОШИБКА.ПРЕДМЕТ_РЕАЛИЗАЦИИ для файла с требованиями
	Пусть открыт файл "тесты.фядот".
	Тогда в список проблем редактора входит ошибка с текстом:
	"""
	Реализация для несуществующего требования Не.существующее.требование
	"""

	@ru_only
	Сценарий: СТРУКТАН.ОШИБКА.ПРЕДМЕТ_РЕАЛИЗАЦИИ для файла с реализацией
	Пусть открыт файл "файл-с-реализацией.txt".
	Тогда в список проблем редактора входит ошибка с текстом:
	"""
	Реализация для несуществующего требования Не.существующее.требование
	"""

	@ru_only
	Сценарий: СТРУКТАН.ОШИБКА.ССЫЛКА
	Пусть открыт файл "тесты.фядот".
	Тогда в список проблем редактора входит ошибка с текстом:
	"""
	Ссылка на несуществующее требование Не.существующее.требование
	"""

	@discard_changes
	Сценарий: СТРУКТАН.ИГНОР_ВНЕШН
	Пусть открыт файл "../../ru/СТРУКТАН.фядот".
	Если получен список ссылок для слова "СТРУКТАН" в следующем тексте:
	"""
	СТРУКТАН.ИГНОР_ВНЕШН
	"""
	То этот список должен быть пуст.

	Сценарий: СТРУКТАН.ТЕСТ.СПИСОК с прямым утверждением о тестировании
	# также $$Тестирует СТРУКТАН.ТЕСТ.УТВ
	Пусть открыт файл "тесты.фядот".
	Если получен список ссылок для слова "Структан" в следующем тексте:
	"""
	Тест.Структан.РЕАЛ_В_КМНТ
	"""
	Тогда этот список должен включать ссылку из файла "файл-с-реализацией.txt" с идентификатором "Тест.Структан.РЕАЛ_В_КМНТ", следующим за текстом "$$Тестирует".

	Сценарий: СТРУКТАН.ТЕСТ.СПИСОК с утверждение о тестировании в сценарии gherkin
	# также $$Тестирует СТРУКТАН.ТЕСТ.GHERKIN
	Пусть открыт файл "тесты.фядот".
	Если получен список ссылок для слова "Тест" в следующем тексте:
	"""
	Тест.Синтан.ИНД_РЕАЛ
	"""
	Тогда этот список должен включать ссылку из файла "тесты.feature" с идентификатором "Тест.Синтан.ИНД_РЕАЛ", следующим за текстом "Сценарий:",
	И этот список должен включать ссылку из файла "тесты.feature" с идентификатором "Тест.Синтан.ИНД_РЕАЛ", следующим за текстом "Шаблон сценария:".

	@ru_only
	Сценарий: СТРУКТАН.ТЕСТ.НЕТ_ТРЕБОВАНИЯ с прямым утверждением о тестировании
	# также $$Тестирует СТРУКТАН.ТЕСТ.УТВ
	Пусть открыт файл "файл-с-реализацией.txt".
	Тогда в список проблем редактора входит ошибка с текстом:
	"""
	Тест для несуществующего требования Не.существующее.требование
	"""

	@ru_only
	Сценарий: СТРУКТАН.ТЕСТ.НЕТ_ТРЕБОВАНИЯ с утверждение о тестировании в сценарии gherkin
	# также $$Тестирует СТРУКТАН.ТЕСТ.GHERKIN
	Пусть открыт файл "тесты.feature".
	Тогда в список проблем редактора входит ошибка с текстом:
	"""
	Тест для несуществующего требования Не.Существующее.Требование
	"""

	@ru_only
	Сценарий: СТРУКТАН.ТЕСТ.НЕТ_ТРЕБОВАНИЯ с утверждение о тестировании в сценарии gherkin для шаблона
	# также $$Тестирует СТРУКТАН.ТЕСТ.GHERKIN
	Пусть открыт файл "тесты.feature".
	Тогда в список проблем редактора входит ошибка с текстом:
	"""
	Тест для несуществующего требования Не.Существующее.Требование.Для_шаблона
	"""

	Сценарий: СТРУКТАН.ТЕСТ.GHERKIN с идентификатором без подмножества идентификаторов
	Пусть открыт файл "тесты.feature".
	Тогда в список проблем редактора не входит проблема с текстом:
	"""
	Тест для несуществующего требования ИдентификаторБезПодмножестваИдентификаторов
	"""

	Сценарий: СТРУКТАН.ТЕСТ.GHERKIN с идентификатором без подмножества идентификаторов для шаблона
	Пусть открыт файл "тесты.feature".
	Тогда в список проблем редактора не входит проблема с текстом:
	"""
	Тест для несуществующего требования ИдентификаторБезПодмножестваИдентификаторов_Для_Шаблона
	"""


