# language: ru

Функция: требования в кукумбере

Сценарий: Тест.Синтан.ИНД_РЕАЛ в заголовке сценария
    Дано: заголовок сценария содержит идентификатор существующего требования.
    Тогда: У этого требования есть ссылка от данного теста.

Сценарий: Не.Существующее.Требование в заголовке сценария
    Дано: заголовок этого сценария содержит идентификатор несуществующего требования.
    Тогда: заголовок помечен ошибкой.

Сценарий: ИдентификаторБезПодмножестваИдентификаторов в заголовке сценария
    Дано: заголовок этого сценария содержит идентификатор несуществующего требования без подмножества идентификаторов.
    Тогда: заголовок не помечен ошибкой.

Шаблон сценария: Тест.Синтан.ИНД_РЕАЛ в заголовке шаблона сценария
    Дано: заголовок шаблона сценария содержит идентификатор существующего требования.
    Тогда: У этого требования есть ссылка от данного теста.
Примеры:
    | вариант |
    | 1       |
    | 2       |

Шаблон сценария: Не.Существующее.Требование.Для_шаблона в заголовке шаблона сценария
    Дано: заголовок шаблона сценария содержит идентификатор несуществующего требования.
    Тогда: заголовок помечен ошибкой.
Примеры:
    | вариант |
    | 1       |
    | 2       |

Шаблон сценария: ИдентификаторБезПодмножестваИдентификаторов_Для_Шаблона в заголовке шаблона сценария
    Дано: заголовок шаблона сценария содержит идентификатор несуществующего требования без подмножества идентификаторов.
    Тогда: заголовок не помечен ошибкой.
Примеры:
    | вариант |
    | 1       |
    | 2       |
